research/visualization_methods/outputs/Feature Functions in Bayesian Regression__parametric_regression/parametric_regression.dot
digraph G {
  "MvNormal" [label="MvNormal"];
  "X" [label="X"];
  "X_benchmark" [label="X_benchmark"];
  "Y" [label="Y"];
  "Y_benchmark" [label="Y_benchmark"];
  "combined_basis" [label="combined_basis"];
  "combined_basis_ωs_all_data" [label="combined_basis_ωs_all_data"];
  "covariance" [label="covariance"];
  "dataset" [label="dataset"];
  "dfs" [label="dfs"];
  "do" [label="do"];
  "fill" [label="fill"];
  "fontfamily" [label="fontfamily"];
  "function plot_inference_results_for(; ϕs, datasets, title" [label="function plot_inference_results_for(; ϕs, datasets, title"];
  "i" [label="i"];
  "infer_ω" [label="infer_ω"];
  "labels" [label="labels"];
  "length" [label="length"];
  "map" [label="map"];
  "mean" [label="mean"];
  "p" [label="p"];
  "p1" [label="p1"];
  "p2" [label="p2"];
  "plot" [label="plot"];
  "ps" [label="ps"];
  "rand" [label="rand"];
  "range" [label="range"];
  "rl" [label="rl"];
  "rng" [label="rng"];
  "rngStableRNG" [label="rngStableRNG"];
  "rr" [label="rr"];
  "x" [label="x"];
  "xs" [label="xs"];
  "y" [label="y"];
  "zeros" [label="zeros"];
  "Λ" [label="Λ"];
  "Σ" [label="Σ"];
  "Φₓ" [label="Φₓ"];
  "μ" [label="μ"];
  "ω" [label="ω"];
  "ϕifor_in11iin1length" [label="ϕifor_in11iin1length"];
  "ϕs" [label="ϕs"];
  "MvNormal" -> "y";
  "MvNormal" -> "ω";
  "X" -> "combined_basis_ωs_all_data";
  "Y" -> "combined_basis_ωs_all_data";
  "combined_basis" -> "combined_basis_ωs_all_data";
  "covariance" -> "y";
  "covariance" -> "ω";
  "dataset" -> "dfs";
  "dataset" -> "ps";
  "do" -> "dfs";
  "do" -> "ps";
  "fill" -> "dataset";
  "fontfamily" -> "p";
  "i" -> "dataset";
  "infer_ω" -> "combined_basis_ωs_all_data";
  "length" -> "xs";
  "map" -> "dfs";
  "map" -> "ps";
  "mean" -> "y";
  "mean" -> "ω";
  "p1" -> "p";
  "p2" -> "p";
  "plot" -> "p";
  "rand" -> "Y_benchmark";
  "range" -> "X_benchmark";
  "range" -> "xs";
  "rl" -> "xs";
  "rng" -> "Y_benchmark";
  "rngStableRNG" -> "function plot_inference_results_for(; ϕs, datasets, title";
  "rr" -> "xs";
  "x" -> "combined_basis_ωs_all_data";
  "y" -> "combined_basis_ωs_all_data";
  "zeros" -> "μ";
  "Λ" -> "y";
  "Σ" -> "ω";
  "Φₓ" -> "y";
  "μ" -> "ω";
  "ω" -> "y";
  "ϕifor_in11iin1length" -> "labels";
  "ϕs" -> "combined_basis_ωs_all_data";
}
